{
  "sources": [
    {
      "title": "Python Software Foundation News",
      "feedUrl": "http://pyfound.blogspot.com/atom.xml",
      "siteUrl": "http://pyfound.blogspot.com/",
      "articles": [
        {
          "id": "http://feedproxy.google.com/~r/PythonSoftwareFoundationNews/~3/cVoVg81ibV0/shamika-mohanan-has-joined-psf-as.html",
          "author": null,
          "description": "The Python Software Foundation (PSF) is excited to welcome Shamika Mohanan as our new Packaging Project Manager! You can learn specifics about the role in our post announcing the position.\n\nRecognizing that the success of the Python language and community relies on the success of its packaging ecosystem, the PSF is excited for the Packaging Project Manager role to facilitate, coordinate, and amplify the existing momentum in this space.\n\nShamika will be performing outreach to Python users to help the PSF better understand the landscape, identify fundable initiatives, seek grants, oversee funded projects, and report on their progress and results to improve Python packaging for all users. Shamika will also work with the PSF Director of Infrastructure to make progress on developing PyPI into a sustainable service that the community can continue to rely on for years to come.\n\nOnce again we want to thank our Visionary Sponsor Bloomberg for their initiative in “Shifting Left” and supporting this role for its initial term of two years.",
          "link": "http://feedproxy.google.com/~r/PythonSoftwareFoundationNews/~3/cVoVg81ibV0/shamika-mohanan-has-joined-psf-as.html",
          "publishedOn": "2021-08-18T09:19:00.002Z",
          "wordCount": 836,
          "title": "Shamika Mohanan has joined the PSF as Packaging Project Manager"
        }
      ]
    },
    {
      "title": "The Django weblog",
      "feedUrl": "https://www.djangoproject.com/rss/weblog/",
      "siteUrl": "https://www.djangoproject.com/weblog/",
      "articles": [
        {
          "id": "https://www.djangoproject.com/weblog/2021/aug/04/2021-django-developers-survey/",
          "author": "William Vincent",
          "description": "The 2021 Django Developers Survey is now live. Please take a moment to fill it out. The survey sheds light on how different developers use Django and the related tools and technologies. After the survey is over, the aggregated results and anonymized raw data will be published.",
          "link": "https://www.djangoproject.com/weblog/2021/aug/04/2021-django-developers-survey/",
          "publishedOn": "2021-08-04T12:49:12.000Z",
          "wordCount": 612,
          "title": "2021 Django Developers Survey"
        }
      ]
    },
    {
      "title": "Ember.js Blog",
      "feedUrl": "https://blog.emberjs.com/rss.xml",
      "siteUrl": "https://blog.emberjs.com/rss.xml",
      "articles": [
        {
          "id": "https://blog.emberjs.com/the-ember-times-issue-187",
          "author": null,
          "description": "👋 Emberistas! 🐹\nRelease: ember-engines-router-service, ember-scroll-modifier and ember-user-activity updates, and Coding with the Dead on Twitch.\n⚙️ Release: ember-engines-router-service\nMichael Villander (@villander) released the ember-engines-router-service addon which provides the Router service for ember-engines.\nThe addon gives you access to the RouterService API inside each engine. This allows you to inject the router service as usual to your component within an engine and use APIs such as transitionTo and even transitionToExternal which help link externalRoutes together.\nimport Component from '@glimmer/component';\nimport { inject as service } from '@ember/service';\nimport { action } from ‘@ember/object’;\n\nexport default class SomeComponent extends Component {\n  @service router;\n\n …",
          "link": "https://blog.emberjs.com/the-ember-times-issue-187",
          "publishedOn": "2021-08-27T00:00:00.000Z",
          "wordCount": 9,
          "title": "The Ember Times - Issue No. 187"
        },
        {
          "id": "https://blog.emberjs.com/the-ember-times-issue-186",
          "author": null,
          "description": "👋 Emberistas! 🐹\nRead the blog post on Avoiding Lifecycle in Components, announcing Glimmer Apollo, new release for ember-responsive-image, and code in public: Ember dev streaming on Twitch.\nBlog post: Avoiding Lifecycle in Components ✍️\nNullVoxPopuli (@NullVoxPopuli) published a blog post on Avoiding Lifecycle in Components, namely the lifecycle hooks that come with ember-render-modifiers.\nFor some context, ember-render-modifiers was created from RFC 415: Render Element Modifiers which introduced  three new generic element modifiers: {{did-insert}}, {{did-update}}, and {{will-destroy}}. The caveat however was that these modifiers were meant for quickly migrating away from classic Ember components to Glimmer components, because they largely allow you to use the same lifecycle hook methods…",
          "link": "https://blog.emberjs.com/the-ember-times-issue-186",
          "publishedOn": "2021-08-16T00:00:00.000Z",
          "wordCount": 9,
          "title": "The Ember Times - Issue No. 186"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}